app/controllers/books_controller.rb

  def edit
    book = domain_factory.book_repository.find_by_id(params[:id])
    @presenter = domain_factory.book_presenter(book, genres: domain_factory.genre_repository.all)
---
SELECT "book_genres".* FROM "book_genres"  WHERE "book_genres"."book_id" IN (1)