app/controllers/books_controller.rb

  def index
    books = domain_factory.book_repository.search_and_filter_for_reader(
                                            current_reader.id,
                                            keyword: params[:keyword],
                                            genre_name: params[:filter]
                                          )
    genres = domain_factory.genre_repository.all
---
SELECT "books".* FROM "books"  WHERE "books"."reader_id" = 463  ORDER BY created_at DESC
SELECT "genres".* FROM "genres"

  def create
    record = domain_factory.book_class.new(book_params)
    book = domain_factory.book_factory.create_for(record, current_reader)
---
INSERT INTO "books" ("amazon_id", "author", "created_at", "description", "keywords", "reader_id", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    book = domain_factory.book_repository.find_by_id(params[:id])
    @presenter = domain_factory.book_presenter(book, nil)

    respond_to do |format|
      if domain_factory.book_repository.update(book, book_params)
---
SELECT  "books".* FROM "books"  WHERE "books"."id" = 1  ORDER BY "books"."id" ASC LIMIT 1
UPDATE "books" SET "description" = $1, "keywords" = $2, "updated_at" = $3 WHERE "books"."id" = 1

  def destroy
    book_repository = domain_factory.book_repository
    book = book_repository.find_by_id(params[:id])
    book_repository.destroy(book)
---
SELECT  "books".* FROM "books"  WHERE "books"."id" = 2  ORDER BY "books"."id" ASC LIMIT 1
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 2]]

    def set_book
      @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books"  WHERE "books"."id" = 1  ORDER BY "books"."id" ASC LIMIT 1